Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Упаковки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РаботаСНоменклатурой/Ext/Module.bsl
Функция УпаковкиНоменклатуры(Ссылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НоменклатураУпаковки.Упаковка КАК Упаковка
		|ИЗ
		|	Справочник.Номенклатура.Упаковки КАК НоменклатураУпаковки
		|ГДЕ
		|	НоменклатураУпаковки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Упаковки = Новый Массив;
	
	Если РезультатЗапроса.Пустой() Тогда
		Упаковки.Добавить(Справочники.УпаковкиНоменклатуры.БезУпаковки);
		Возврат Упаковки;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	Для Каждого Строка Из ВыборкаДетальныеЗаписи Цикл
		Упаковки.Добавить(Строка.Упаковка);
	КонецЦикла;
	
	Возврат Упаковки;

КонецФункции // УпаковкиНоменклатуры()
